GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.inc
// Register: SMT2CPWL
#define SMT2CPWL SMT2CPWL
SMT2CPWL                                 equ 0512h
// bitfield definitions
SMT2CPWL_CPW_POSN                        equ 0000h
SMT2CPWL_CPW_POSITION                    equ 0000h
SMT2CPWL_CPW_SIZE                        equ 0008h
SMT2CPWL_CPW_LENGTH                      equ 0008h
SMT2CPWL_CPW_MASK                        equ 00FFh
SMT2CPWL_CPW0_POSN                       equ 0000h
SMT2CPWL_CPW0_POSITION                   equ 0000h
SMT2CPWL_CPW0_SIZE                       equ 0001h
SMT2CPWL_CPW0_LENGTH                     equ 0001h
SMT2CPWL_CPW0_MASK                       equ 0001h
SMT2CPWL_CPW1_POSN                       equ 0001h
SMT2CPWL_CPW1_POSITION                   equ 0001h
SMT2CPWL_CPW1_SIZE                       equ 0001h
SMT2CPWL_CPW1_LENGTH                     equ 0001h
SMT2CPWL_CPW1_MASK                       equ 0002h
SMT2CPWL_CPW2_POSN                       equ 0002h
SMT2CPWL_CPW2_POSITION                   equ 0002h
SMT2CPWL_CPW2_SIZE                       equ 0001h
SMT2CPWL_CPW2_LENGTH                     equ 0001h
SMT2CPWL_CPW2_MASK                       equ 0004h
SMT2CPWL_CPW3_POSN                       equ 0003h
SMT2CPWL_CPW3_POSITION                   equ 0003h
SMT2CPWL_CPW3_SIZE                       equ 0001h
SMT2CPWL_CPW3_LENGTH                     equ 0001h
SMT2CPWL_CPW3_MASK                       equ 0008h
SMT2CPWL_CPW4_POSN                       equ 0004h
SMT2CPWL_CPW4_POSITION                   equ 0004h
SMT2CPWL_CPW4_SIZE                       equ 0001h
SMT2CPWL_CPW4_LENGTH                     equ 0001h
SMT2CPWL_CPW4_MASK                       equ 0010h
SMT2CPWL_CPW5_POSN                       equ 0005h
SMT2CPWL_CPW5_POSITION                   equ 0005h
SMT2CPWL_CPW5_SIZE                       equ 0001h
SMT2CPWL_CPW5_LENGTH                     equ 0001h
SMT2CPWL_CPW5_MASK                       equ 0020h
SMT2CPWL_CPW6_POSN                       equ 0006h
SMT2CPWL_CPW6_POSITION                   equ 0006h
SMT2CPWL_CPW6_SIZE                       equ 0001h
SMT2CPWL_CPW6_LENGTH                     equ 0001h
SMT2CPWL_CPW6_MASK                       equ 0040h
SMT2CPWL_CPW7_POSN                       equ 0007h
SMT2CPWL_CPW7_POSITION                   equ 0007h
SMT2CPWL_CPW7_SIZE                       equ 0001h
SMT2CPWL_CPW7_LENGTH                     equ 0001h
SMT2CPWL_CPW7_MASK                       equ 0080h
SMT2CPWL_SMT2CPW_POSN                    equ 0000h
SMT2CPWL_SMT2CPW_POSITION                equ 0000h
SMT2CPWL_SMT2CPW_SIZE                    equ 0008h
SMT2CPWL_SMT2CPW_LENGTH                  equ 0008h
SMT2CPWL_SMT2CPW_MASK                    equ 00FFh
SMT2CPWL_SMT2CPW0_POSN                   equ 0000h
SMT2CPWL_SMT2CPW0_POSITION               equ 0000h
SMT2CPWL_SMT2CPW0_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW0_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW0_MASK                   equ 0001h
SMT2CPWL_SMT2CPW1_POSN                   equ 0001h
SMT2CPWL_SMT2CPW1_POSITION               equ 0001h
SMT2CPWL_SMT2CPW1_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW1_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW1_MASK                   equ 0002h
SMT2CPWL_SMT2CPW2_POSN                   equ 0002h
SMT2CPWL_SMT2CPW2_POSITION               equ 0002h
SMT2CPWL_SMT2CPW2_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW2_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW2_MASK                   equ 0004h
SMT2CPWL_SMT2CPW3_POSN                   equ 0003h
SMT2CPWL_SMT2CPW3_POSITION               equ 0003h
SMT2CPWL_SMT2CPW3_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW3_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW3_MASK                   equ 0008h
SMT2CPWL_SMT2CPW4_POSN                   equ 0004h
SMT2CPWL_SMT2CPW4_POSITION               equ 0004h
SMT2CPWL_SMT2CPW4_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW4_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW4_MASK                   equ 0010h
SMT2CPWL_SMT2CPW5_POSN                   equ 0005h
SMT2CPWL_SMT2CPW5_POSITION               equ 0005h
SMT2CPWL_SMT2CPW5_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW5_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW5_MASK                   equ 0020h
SMT2CPWL_SMT2CPW6_POSN                   equ 0006h
SMT2CPWL_SMT2CPW6_POSITION               equ 0006h
SMT2CPWL_SMT2CPW6_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW6_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW6_MASK                   equ 0040h
SMT2CPWL_SMT2CPW7_POSN                   equ 0007h
SMT2CPWL_SMT2CPW7_POSITION               equ 0007h
SMT2CPWL_SMT2CPW7_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW7_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW7_MASK                   equ 0080h

// Register: SMT2CPWH
#define SMT2CPWH SMT2CPWH
SMT2CPWH                                 equ 0513h
// bitfield definitions
SMT2CPWH_CPW_POSN                        equ 0000h
SMT2CPWH_CPW_POSITION                    equ 0000h
SMT2CPWH_CPW_SIZE                        equ 0008h
SMT2CPWH_CPW_LENGTH                      equ 0008h
SMT2CPWH_CPW_MASK                        equ 00FFh
SMT2CPWH_CPW8_POSN                       equ 0000h
SMT2CPWH_CPW8_POSITION                   equ 0000h
SMT2CPWH_CPW8_SIZE                       equ 0001h
SMT2CPWH_CPW8_LENGTH                     equ 0001h
SMT2CPWH_CPW8_MASK                       equ 0001h
SMT2CPWH_CPW9_POSN                       equ 0001h
SMT2CPWH_CPW9_POSITION                   equ 0001h
SMT2CPWH_CPW9_SIZE                       equ 0001h
SMT2CPWH_CPW9_LENGTH                     equ 0001h
SMT2CPWH_CPW9_MASK                       equ 0002h
SMT2CPWH_CPW10_POSN                      equ 0002h
SMT2CPWH_CPW10_POSITION                  equ 0002h
SMT2CPWH_CPW10_SIZE                      equ 0001h
SMT2CPWH_CPW10_LENGTH                    equ 0001h
SMT2CPWH_CPW10_MASK                      equ 0004h
SMT2CPWH_CPW11_POSN                      equ 0003h
SMT2CPWH_CPW11_POSITION                  equ 0003h
SMT2CPWH_CPW11_SIZE                      equ 0001h
SMT2CPWH_CPW11_LENGTH                    equ 0001h
SMT2CPWH_CPW11_MASK                      equ 0008h
SMT2CPWH_CPW12_POSN                      equ 0004h
SMT2CPWH_CPW12_POSITION                  equ 0004h
SMT2CPWH_CPW12_SIZE                      equ 0001h
SMT2CPWH_CPW12_LENGTH                    equ 0001h
SMT2CPWH_CPW12_MASK                      equ 0010h
SMT2CPWH_CPW13_POSN                      equ 0005h
SMT2CPWH_CPW13_POSITION                  equ 0005h
SMT2CPWH_CPW13_SIZE                      equ 0001h
SMT2CPWH_CPW13_LENGTH                    equ 0001h
SMT2CPWH_CPW13_MASK                      equ 0020h
SMT2CPWH_CPW14_POSN                      equ 0006h
SMT2CPWH_CPW14_POSITION                  equ 0006h
SMT2CPWH_CPW14_SIZE                      equ 0001h
SMT2CPWH_CPW14_LENGTH                    equ 0001h
SMT2CPWH_CPW14_MASK                      equ 0040h
SMT2CPWH_CPW15_POSN                      equ 0007h
SMT2CPWH_CPW15_POSITION                  equ 0007h
SMT2CPWH_CPW15_SIZE                      equ 0001h
SMT2CPWH_CPW15_LENGTH                    equ 0001h
SMT2CPWH_CPW15_MASK                      equ 0080h
SMT2CPWH_SMT2CPW_POSN                    equ 0000h
SMT2CPWH_SMT2CPW_POSITION                equ 0000h
SMT2CPWH_SMT2CPW_SIZE                    equ 0008h
SMT2CPWH_SMT2CPW_LENGTH                  equ 0008h
SMT2CPWH_SMT2CPW_MASK                    equ 00FFh
SMT2CPWH_SMT2CPW8_POSN                   equ 0000h
SMT2CPWH_SMT2CPW8_POSITION               equ 0000h
SMT2CPWH_SMT2CPW8_SIZE                   equ 0001h
SMT2CPWH_SMT2CPW8_LENGTH                 equ 0001h
SMT2CPWH_SMT2CPW8_MASK                   equ 0001h
SMT2CPWH_SMT2CPW9_POSN                   equ 0001h
SMT2CPWH_SMT2CPW9_POSITION               equ 0001h
SMT2CPWH_SMT2CPW9_SIZE                   equ 0001h
SMT2CPWH_SMT2CPW9_LENGTH                 equ 0001h
SMT2CPWH_SMT2CPW9_MASK                   equ 0002h
SMT2CPWH_SMT2CPW10_POSN                  equ 0002h
SMT2CPWH_SMT2CPW10_POSITION              equ 0002h
SMT2CPWH_SMT2CPW10_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW10_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW10_MASK                  equ 0004h
SMT2CPWH_SMT2CPW11_POSN                  equ 0003h
SMT2CPWH_SMT2CPW11_POSITION              equ 0003h
SMT2CPWH_SMT2CPW11_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW11_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW11_MASK                  equ 0008h
SMT2CPWH_SMT2CPW12_POSN                  equ 0004h
SMT2CPWH_SMT2CPW12_POSITION              equ 0004h
SMT2CPWH_SMT2CPW12_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW12_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW12_MASK                  equ 0010h
SMT2CPWH_SMT2CPW13_POSN                  equ 0005h
SMT2CPWH_SMT2CPW13_POSITION              equ 0005h
SMT2CPWH_SMT2CPW13_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW13_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW13_MASK                  equ 0020h
SMT2CPWH_SMT2CPW14_POSN                  equ 0006h
SMT2CPWH_SMT2CPW14_POSITION              equ 0006h
SMT2CPWH_SMT2CPW14_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW14_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW14_MASK                  equ 0040h
SMT2CPWH_SMT2CPW15_POSN                  equ 0007h
SMT2CPWH_SMT2CPW15_POSITION              equ 0007h
SMT2CPWH_SMT2CPW15_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW15_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW15_MASK                  equ 0080h

