GopalSaraf/Practicals/PSDL/include/proc/pic16f18877.inc
// Register: CCDPD
#define CCDPD CCDPD
CCDPD                                    equ 01F62h
// bitfield definitions
CCDPD_CCDPD0_POSN                        equ 0000h
CCDPD_CCDPD0_POSITION                    equ 0000h
CCDPD_CCDPD0_SIZE                        equ 0001h
CCDPD_CCDPD0_LENGTH                      equ 0001h
CCDPD_CCDPD0_MASK                        equ 0001h
CCDPD_CCDPD1_POSN                        equ 0001h
CCDPD_CCDPD1_POSITION                    equ 0001h
CCDPD_CCDPD1_SIZE                        equ 0001h
CCDPD_CCDPD1_LENGTH                      equ 0001h
CCDPD_CCDPD1_MASK                        equ 0002h
CCDPD_CCDPD2_POSN                        equ 0002h
CCDPD_CCDPD2_POSITION                    equ 0002h
CCDPD_CCDPD2_SIZE                        equ 0001h
CCDPD_CCDPD2_LENGTH                      equ 0001h
CCDPD_CCDPD2_MASK                        equ 0004h
CCDPD_CCDPD3_POSN                        equ 0003h
CCDPD_CCDPD3_POSITION                    equ 0003h
CCDPD_CCDPD3_SIZE                        equ 0001h
CCDPD_CCDPD3_LENGTH                      equ 0001h
CCDPD_CCDPD3_MASK                        equ 0008h
CCDPD_CCDPD4_POSN                        equ 0004h
CCDPD_CCDPD4_POSITION                    equ 0004h
CCDPD_CCDPD4_SIZE                        equ 0001h
CCDPD_CCDPD4_LENGTH                      equ 0001h
CCDPD_CCDPD4_MASK                        equ 0010h
CCDPD_CCDPD5_POSN                        equ 0005h
CCDPD_CCDPD5_POSITION                    equ 0005h
CCDPD_CCDPD5_SIZE                        equ 0001h
CCDPD_CCDPD5_LENGTH                      equ 0001h
CCDPD_CCDPD5_MASK                        equ 0020h
CCDPD_CCDPD6_POSN                        equ 0006h
CCDPD_CCDPD6_POSITION                    equ 0006h
CCDPD_CCDPD6_SIZE                        equ 0001h
CCDPD_CCDPD6_LENGTH                      equ 0001h
CCDPD_CCDPD6_MASK                        equ 0040h
CCDPD_CCDPD7_POSN                        equ 0007h
CCDPD_CCDPD7_POSITION                    equ 0007h
CCDPD_CCDPD7_SIZE                        equ 0001h
CCDPD_CCDPD7_LENGTH                      equ 0001h
CCDPD_CCDPD7_MASK                        equ 0080h

// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 01F64h
// bitfield definitions
ANSELE_ANSE0_POSN                        equ 0000h
ANSELE_ANSE0_POSITION                    equ 0000h
ANSELE_ANSE0_SIZE                        equ 0001h
ANSELE_ANSE0_LENGTH                      equ 0001h
ANSELE_ANSE0_MASK                        equ 0001h
ANSELE_ANSE1_POSN                        equ 0001h
ANSELE_ANSE1_POSITION                    equ 0001h
ANSELE_ANSE1_SIZE                        equ 0001h
ANSELE_ANSE1_LENGTH                      equ 0001h
ANSELE_ANSE1_MASK                        equ 0002h
ANSELE_ANSE2_POSN                        equ 0002h
ANSELE_ANSE2_POSITION                    equ 0002h
ANSELE_ANSE2_SIZE                        equ 0001h
ANSELE_ANSE2_LENGTH                      equ 0001h
ANSELE_ANSE2_MASK                        equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 01F65h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 01F66h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 01F67h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 01F68h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 01F69h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 01F6Ah
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

